<form [formGroup]="loginForm" (ngSubmit)="LogIn()">
  <label>Username:
    <br />
    <input formControlName="username">
  </label>
  <br />
  <br />
  <label>Password:
    <br />
    <input formControlName="password">
  </label>
  <br />
  <br />
  <button type="submit">Log In</button>
  <button type="button" routerLink="/newUser">New User</button>
</form>

<br />
<br />

<!-- <form [formGroup]="queryForm" (ngSubmit)="run()">
  <label>Cypher Query:
    <br />
    <textarea formControlName="query" placeholder="MATCH (o:Object {attrib: {value}}) RETURN o"></textarea>
  </label>
  <br />
  <br />
  <label>Parameters JSON:
    <br />
    <textarea formControlName="params" placeholder='{ "value": "value" }'></textarea>
  </label>
  <br />
  <br />
  <button type="submit">Run</button>
</form>

<br />
<br />

Results:
<pre>
{{results | json}}
</pre>  -->